Autodesk.Navisworks.Api.Data.NavisworksDataAdapter
Implementation of DbDataAdapter.

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.#ctor
Default constructor

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.#ctor(Autodesk.Navisworks.Api.Data.NavisworksCommand)
Constructs a data adapter using the specified select command.
selectCommand: The select command to associate with the adapter.

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.#ctor(System.String,Autodesk.Navisworks.Api.Data.NavisworksConnection)
Constructs a data adapter with the supplied select command text and associated with the specified connection.
commandText: The select command text to associate with the data adapter.
connection: The connection to associate with the select command.

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.DeleteCommand
Gets/sets the delete command for this DataAdapter

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.InsertCommand
Gets/sets the insert command for this DataAdapter

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.OnRowUpdated(System.Data.Common.RowUpdatedEventArgs)
Raised by DbDataAdapter after a row is updated
value: The event's specifics

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.OnRowUpdating(System.Data.Common.RowUpdatingEventArgs)
Raised by the underlying DbDataAdapter when a row is being updated
value: The event's specifics

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.RowUpdated
Row updated event handler

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.RowUpdating
Row updating event handler

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.SelectCommand
Gets/sets the select command for this DataAdapter

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.Update(System.Data.DataRow[])
Not implement

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.Update(System.Data.DataSet)
Not implement

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.Update(System.Data.DataSet,System.String)
Not implement

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.Update(System.Data.DataTable)
Not implement

Autodesk.Navisworks.Api.Data.NavisworksDataAdapter.UpdateCommand
Gets/sets the update command for this DataAdapter